damBreak/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application interFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 0.4;

deltaT 0.001;

writeControl adjustableRunTime;

writeInterval 0.4;

purgeWrite 0;

writeFormat binary;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep yes;
maxCo 1;

maxAlphaCo 1;

maxDeltaT 1; 	// ************************************************************************* //

functions
{
#includeFunc singleGraph}

